app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
  def index
    @emails = Email.all

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "Clouds of Witness"], ["body", "Biography/Autobiography"], ["created_at", "2021-06-03 09:25:58.308366"], ["updated_at", "2021-06-03 09:25:58.308366"]]
---
  def create
    @email = Email.new(
      object: Faker::Book.title,
      body: Faker::Book.genre
    )



    respond_to do |format|
      if @email.save

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 7]]
---
  def destroy
    @email = Email.find(params[:id])
    @email.destroy

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_email
      @email = Email.find(params[:id])